[
	{
		"_id": {
			"$oid": "63e29b5af5cbbf8fe39fe5dd"
		},
		"title": "Creamy Chicken Enchilada Soup",
		"prep_time": "20 minutes",
		"cook_time": "20 minutes",
		"total_time": "40 miutes",
		"servings": "6 - 8 servings",
		"ingredients": [
			{
				"name": "For the soup: 1 tbs olive oil, 1 medium white onion, 1 clove garlic, 1 tbs ancho chili powder, 1 tsp dried oregano, 2 tsp brown sugar, 1/2 tsp salt, 2- 28 oz cans of whole, peeled tomatoes with juice, 4 oz shredded monterey jack cheese, 1 cup chicken stock, 1/2 cup heavy cream, 3 cups shredded cooked chicken, 3 cups corn kernels, fresh or frozen, 1- 14.5 oz can black beans, rinsed and drained"
			},
			{ "name": "For the cream: 1/4 cup sour cream, 1/4 cup heavy cream" },
			{
				"name": "For garnishing: cilantro leaves, thinly sliced jalepenos, lime wedges, crumbled ctija cheese (or feta), diced avocado, warm corn tortillas, diced white onion, shredded monterey jack cheese"
			}
		],
		"directions": [
			{
				"content": "In a large pot over medium heat, heat the oil. Add the onion and cook for 5 to 7 minutes, stirring often, until soft and golden. Stir in the garlic, chili powder, oregano, brown sugar, and salt. Cook, stirring often, for 1 minute."
			},
			{
				"content": "Stir in the tomatoes and bring the mixture to a simmer. Break up the tomatoes—I use a potato masher, but you could do it with a wooden spoon—and simmer uncovered for 10 minutes. Stir in the shredded cheese."
			},
			{
				"content": "Carefully, ladle the soup into a blender. Cover the blender with a lid and cover the lid with a folded dish towel. Starting on low speed, purée the soup for about 30 seconds. Gradually increase the speed to medium-high and blend for another minute, until the soup is smooth. You may need to blend the soup in batches or you could use an immersion blender to blend the soup directly in the pot."
			},
			{
				"content": "Return the soup to the pot and set it over medium heat. Stir in the stock, cream, chicken, corn, and beans. Bring to a gentle simmer, stirring often. Taste and adjust seasoning with more salt if you would like."
			},
			{
				"content": "In a small bowl, stir the sour cream and milk or cream together until smooth. The consistency should be pourable, like thick cream."
			},
			{
				"content": "Ladle the soup into bowls and spoon some homemade crema over each. Lay out the garnishes on the table in small individual bowls and let everyone top their soup to their liking."
			}
		],
		"image": ""
	},
	{
		"_id": {
			"$oid": "63e29b5af5cbbf8fe39fe5de"
		},
		"title": "Creamy Baked Mac and Cheese",
		"prep_time": "20 minutes",
		"cook_time": "25 minutes",
		"total_time": "45 minutes",
		"servings": "6 - 8 servings",
		"ingredients": [
			{
				"name": "For the topping: 2 tablespoons melted unsalted butter, 2/3 cup plain panko breadcrumbs, 1/4 cup shredded Parmesan, 1/4 teaspoon kosher salt, 1/8 teaspoon smoked paprika, Pinch cayenne pepper "
			},
			{ "name": "For the macaroni: 10 ounces elbow macaroni pasta or cavatappi, 1 tablespoon kosher salt, 1 tablespoon unsalted butter " },
			{
				"name": "For the sauce: 4 ounces cream cheese, 1 (10-ounce) brick cheddar cheese, shredded (about 3 cups thickly shredded cheddar cheese), 2 1/2 cups whole milk, 1/2 teaspoon white pepper, 1/2 teaspoon kosher salt, 1/2 teaspoon mustard powder, 1/4 teaspoon turmeric powder"
			}
		],
		"directions": [
			{ "content": "Preheat the oven to 350°F. Butter an 8 x 8 pan and set aside." },
			{ "content": "In a small bowl, melt 2 tablespoons of butter. Add panko, Parmesan, salt, smoked paprika, and cayenne pepper. Set aside." },
			{
				"content": "Bring a pot of water to a boil over medium high heat. Add the macaroni and salt. Cook until the pasta is firm-tender, or al dente. Usually, this takes about a minute or two less than the cook time recommended on the box."
			},
			{
				"content": "Drain the pasta into a colander. Add 1 tablespoon butter to the same pot you boiled the pasta in. Add the drained pasta back to the pan and stir to coat. Remove from heat. You will get back to it later."
			},
			{
				"content": "In a large, high sided skillet set over medium heat, add the cream cheese, 1 cup of milk, and all of the spices. Break apart and smash the cream cheese with a spatula as it begins to soften and melt. Once the cream cheese is in pieces the size of a nickel or smaller, whisk the mixture until it is homogeneous and thickened, about 4 to 5 minutes."
			},
			{
				"content": "Whisk the remaining 1 1/2 cups of milk into the sauce. Add the cheddar cheese one cup at a time, whisking continuously. Make sure each cup is incorporated before adding the next."
			},
			{
				"content": "Once the sauce is thick like heavy whipping cream and homogeneous, add the pasta. Stir to coat. It will look soupy. That’s what you want. Transfer the mixture to the buttered 8x8 pan. Smooth the top."
			},
			{
				"content": "Sprinkle the panko mixture over the top of the mac and cheese. Place in oven for 20 to 25 minutes until the top is golden brown and the cheese sauce is bubbling around the edges. Cool briefly before serving."
			}
		],
		"image": ""
	},
	{
		"_id": {
			"$oid": "63e29b5af5cbbf8fe39fe5df"
		},
		"title": "Ginger Garlic Sesame Shrimp",
		"prep_time": "20 minutes",
		"cook_time": "10 minutes",
		"total_time": "30 minutes",
		"servings": "2 - 3 servings",
		"ingredients": [
			{
				"name": "For the marinade: 1/4 cup soy sauce (use gluten-free soy sauce for gluten-free version), 2 tablespoons seasoned rice vinegar, 2 teaspoons brown sugar, 2 tablespoons extra virgin olive oil, 1 teaspoon dark sesame oil, 3 cloves garlic, minced (about 1 tablespoon), 1 tablespoon grated ginger"
			},
			{
				"name": "For the Shrimp: 1 pound (16-20 count) shrimp, peeled and deveined, 1 tablespoon peanut oil or canola oil, 3 green onions sliced on the diagonal, 1 tablespoon sesame seeds"
			}
		],
		"directions": [
			{
				"content": "In a medium bowl whisk together the soy sauce, seasoned rice vinegar, and brown sugar until the sugar has dissolved. Then whisk in the olive oil, sesame oil, minced garlic, and grated ginger. Place the shrimp in the bowl with the marinade. Toss to coat with the marinade and chill until ready to cook."
			},
			{ "content": "Toast the sesame seeds in a small sauté pan on medium high heat until lightly browned." },
			{
				"content": "Heat cooking oil in a large stick-free sauté pan or wok (can use seasoned cast iron) on high heat. When the oil is shimmering hot, almost smoking, use a slotted spoon to move the shrimp from the marinade into the hot pan. (Watch out, it will splatter.) Stir-fry for a minute."
			},
			{
				"content": "Add half of the sliced green onions. Continue to stir-fry, turning the individual shrimp over if necessary, until the shrimp are pink and just cooked through. No more than 2 minutes max total cooking time, a minute on each side."
			},
			{
				"content": "Remove shrimp from pan and transfer to a serving bowl. Place the remaining marinade in the hot sauté pan and simmer it until it has reduced to a syrup."
			},
			{ "content": "Pour over the shrimp. Toss to coat. Sprinkle the shrimp with toasted sesame seeds and remaining green onions." },
			{ "content": "Serve immediately with rice, soba noodles, rice noodles, bok choy, spinach, broccoli, or asparagus." }
		],
		"image": ""
	}
]
